# Arithmetic & Data Alignment

An important pandas feature for some applications is the behaviour of arithmetic between objects with different indexes. When you are adding together objects, if any index pairs are not the same, the respective index in the result will be the union of the index pairs. Similar to an outer join:

In [5]:
import pandas as pd
import numpy as np

s1 = pd.Series(np.random.randn(5), index=['a','b','c','d','f'])
s2 = pd.Series(np.random.randn(5), index=['a','b','c','g','f'])

In [6]:
s1+s2

a   -0.694981
b    1.722428
c    0.444750
d         NaN
f    1.092236
g         NaN
dtype: float64

#### The missing values in the label locations are those that dont overlap

The same happens in DataFrames

In [9]:
df1 = pd.DataFrame(np.arange(9.).reshape((3,3)), index=['Ohio','Texas','Utah'], columns = list('bca'))
df2 = pd.DataFrame(np.arange(12.).reshape((4,3)), index=['Ohio','Texas','Utah', 'Maine'], columns = list('bda'))
df2

         b     d     a
Ohio   0.0   1.0   2.0
Texas  3.0   4.0   5.0
Utah   6.0   7.0   8.0
Maine  9.0  10.0  11.0

In [10]:
#Adding these together returns a DF whose index and columns are the unions of the ones of each DataFrame
#since 'c' and 'd' are not present in both dataframes, NaN appears for both columns of the union
df2+df1

          a     b   c   d
Maine   NaN   NaN NaN NaN
Ohio    4.0   0.0 NaN NaN
Texas  10.0   6.0 NaN NaN
Utah   16.0  12.0 NaN NaN

#### If you add or subtract two DFâ€™s with no rows or columns in common, the result will contain all nulls.

### Arithmetic Methods with Fill Values
In artithmetic operations between differently indexed objects, you might want to fill with a special value, like 0, when an axis label is found in one object but not the other.

We see that NaN appears where the two DFs dont overlap. We can use the .add method on df1, pass df2 and an arguments to fill_value. This will populate the NA columns with the orignial value found in the DF.

Can use fill_value=0 when reindexing

In [22]:
df1.reindex(columns=df2.columns, fill_value=0)

         b  d    a
Ohio   0.0  0  2.0
Texas  3.0  0  5.0
Utah   6.0  0  8.0

### Operations Between DataFrame and Series

Operations between Dataframes and Series are similar to that of arrays with different dimensions. Heres an example of creating a DF and series, and then subtracting the series from the DF:

In [23]:
df2

         b     d     a
Ohio   0.0   1.0   2.0
Texas  3.0   4.0   5.0
Utah   6.0   7.0   8.0
Maine  9.0  10.0  11.0

In [25]:
series = df2.iloc[0]

In [26]:
df2-series

         b    d    a
Ohio   0.0  0.0  0.0
Texas  3.0  3.0  3.0
Utah   6.0  6.0  6.0
Maine  9.0  9.0  9.0

<b>What happens is that a subtraction is performed for each row. This is known as broadcasting.
If an index value is not found in either the DF columns or the series index, the objects will be reindexed to form the union</b>